{
    "headline": "Where do Texas Democrats go from here??",
    "deck": "The only way is up.",
    "desk": "Politics",
    "section": "News",
    "published-date": "Dec. 20, 2016",
    "authors": [
        {
            "name": "Brandi Grissom",
            "twitter": "brandigrissom",
            "email": "bgrissom@dallasnews.com"
        },
        {
            "name": "Jon McClure",
            "twitter": "jonrmcclure",
            "email": "[jmcclure@dallasnews.com](mailto:jmcclure@dallasnews.com)"
        }
    ],
    "body": [
        {
            "type": "text",
            "value": "Donald Trump was supposed to be Texas Democrats' savior."
        },
        {
            "type": "text",
            "value": "His divisive, anti-immigrant rhetoric and wall-building promises would drive Hispanic voters to the ballot box. His raunchy, sexist comments and multiple allegations of groping and inappropriate behavior would send women into more welcoming Democratic arms. College-educated Texans surely would be turned off by Trump's denial of scientific theories like global warming."
        },
        {
            "type": "text",
            "value": "Indeed, Texas Democrats made strides in urban areas and some local elections. In the presidential race, they saw the third-largest Democratic shift from 2012, behind California and Utah."
        },
        {
            "type": "text",
            "value": "\"Texas Democrats took a significant step forward,\" said Manny Garcia, deputy executive director of the state party."
        },
        {
            "type": "text",
            "value": "But election data shows that Texas Democrats came out of the 2016 general election no closer to securing a statewide elected office for the first time since 1994. An analysis of two decades of election returns in statewide races shows Texas Democrats still struggling to close a yawning gap that has grown since the 1990s."
        },
        {
            "type": "embed",
            "value": {
                "slug": "adblock-top"
            }
        },
        {
            "type": "text",
            "value": "Sure, Democrats will insist, Trump won by a measly 9 percent over Democrat Hillary Clinton, a much smaller margin than the 16 percent that Republican Mitt Romney secured in 2012."
        },
        {
            "type": "text",
            "value": "But hidden behind that number is the fact that state Democrats had as little success this year in statewide contested races as they did the previous two presidential cycles and have lost touch with white rural voters, among whom Republicans have grown their advantage year-over-year into a nearly 4-1 margin."
        },
        {
            "type": "text",
            "value": "\"Democrats talked a good game and pretended, but they didn't do anything that really mattered,\" said Matt Mackowiak, an Austin-based Republican consultant."
        },
        {
            "type": "text",
            "value": "There were some hopeful signs in the results, though, that could shed light on a potential path to success if downtrodden Democrats could muster the organizational strength to capitalize on those minimal gains. The party did well with urban voters and Hispanic Texans. Those demographic groups hold the key to future political success in the state."
        },
        {
            "type": "text",
            "value": "\"There are plenty of silver linings here,\" said Harold Cook, a Democratic consultant based in Austin."
        },
        {
            "type": "embed",
            "value": {
                "slug": "state-choropleths",
                "headline": "Metropolitan success",
                "chatter": "On a county results map, Democrats' gains in urban areas are masked by the vast swaths of rural Texas where Democrats have often lost 2-to-1. But a map that gives equal area to each vote in the presidential election, better representing the popular vote, shows how competitive Texas could be if Democrats capitalized on their metro advantage."
            }
        },
        {
            "type": "text",
            "value": "But expert observers wonder whether Democrats are so far behind in Texas that they'll remain stuck in park while Republicans continue to drive the state's agenda."
        },
        {
            "type": "text",
            "value": "\"You've got 30 or more years of Democrats losing statewide elections and being pummeled in local elections,\" said Brandon Rottinghaus, a political science professor at the University of Houston. \"It takes a tremendous amount of time to build that back.\""
        },
        {
            "type": "text",
            "value": "Texas has been a GOP stronghold since the Reagan era. The 1978 election of Bill Clements as governor marked the end of more than a century of Democratic governors. No Democrat has been elected governor since Republican George W. Bush took office in 1994. Since then, Republicans' hold on statewide offices has strengthened. And this year, Lawrence Meyers, [the only Democrat who held statewide office -- because he switched from the Republican Party while in that position ](https://www.google.com/url?q=http://www.dallasnews.com/news/texas-politics/2016/11/08/lone-statewide-elected-democrat-loses-along-partys-hopes-texas-comeback&sa=D&ust=1482208845711000&usg=AFQjCNHeEODiakyD1EOrmDQ2ocoyFgAcSw)-- lost his election."
        },
        {
            "type": "text",
            "value": "In the three general elections before 2016, Republicans won contested statewide races by better than a 2-1 margin in 153 of the state's 254 counties. This year, Republicans cleared the same margin in 197 counties -- with a presidential candidate who was difficult even for his own party to love."
        },
        {
            "type": "embed",
            "value": {
                "slug": "county-voting-scatterplot",
                "headline": "Democrats' deficit",
                "chatter": "For Democrats to become competitive in Texas again, they will need to make up a generation of ground lost to Republicans, who have gone from strength to strength in statewide contested races in every election since 1992."
            }
        },
        {
            "type": "text",
            "value": "That the GOP did well with Texas voters, in an election cycle where the presidential choice was less than ideal, bodes well for the party in midterm elections, Mackowiak said. In 2018, Texas voters will decide races for governor, lieutenant governor, attorney general and other offices that draw from the party's long-established slate of contenders. That's bound to push GOP victory margins back into double digits."
        },
        {
            "type": "text",
            "value": "\"You won't have Trump driving votes against Republicans, which he was doing in some areas,\" Mackowiak said. \"It will be a much more traditional Republican vs. Democrat generic election cycle.\""
        },
        {
            "type": "text",
            "value": "It wasn't all doom and gloom for Democrats, though. There are twinkles of hope among urban and Hispanic voters."
        },
        {
            "type": "embed",
            "value": {
                "slug": "adblock-middle"
            }
        },
        {
            "type": "text",
            "value": "Texas' six major metro counties -- Bexar, Collin, Dallas, Harris, Tarrant and Travis -- account for almost half the state's population. This year, Clinton beat Obama's 2012 margin by 7 to 15 points in each county, and she won four of those counties outright. Democrats in contested statewide elections in the metro counties won two-thirds of their races in 2016, up from just more than half between 2008 and 2014."
        },
        {
            "type": "text",
            "value": "In 15 of Texas' 32 border counties, no Republican has won a majority in a contested race for any statewide office since 2010. In five more of those counties, Democrats have won 4 out of every 5 contested statewide races."
        },
        {
            "type": "text",
            "value": "\"Texas voters are increasingly trusting Democrats,\" said Garcia, the party's deputy executive director."
        },
        {
            "type": "embed",
            "value": {
                "slug": "regional-small-multiples",
                "headline": "Geographic patterns",
                "chatter1": "Democrats have made races more competitive than the state average for three straight elections.",
                "chatter2": "Republicans have the edge, but the margins have narrowed in recent years.",
                "chatter3": "Democrats dominate. The party has consistently won in 20 of these 32 counties.",
                "chatter4": "Republicans reign. Only two of these counties have voted for any statewide Democratic candidate since 2010."
            }
        },
        {
            "type": "text",
            "value": "In local races, Democrats also saw gains in urban areas, winning four seats in the Texas House, though they remain vastly outnumbered in the 150-member chamber."
        },
        {
            "type": "text",
            "value": "James Aldrete, a Democratic consultant, said those gains were significant for the party, especially given that the Clinton campaign spent little time and money in Texas."
        },
        {
            "type": "text",
            "value": "\"Even without air cover, you had progress,\" he said."
        },
        {
            "type": "text",
            "value": "But if Democrats are to turn those hopeful sparks into fuel for a resurgence, they can't rely on only urban and Hispanic voters, experts said."
        },
        {
            "type": "text",
            "value": "\"If Democrats are just depending on that vote, it's going to be a long time before Texas turns purple, let alone blue,\" said Paul Stekler, a radio-television-film professor at the University of Texas who has produced Texas political documentaries."
        },
        {
            "type": "embed",
            "value": {
                "slug": "adblock-bottom"
            }
        },
        {
            "type": "text",
            "value": "The turnout among those demographic groups simply isn't high enough, particularly during nonpresidential election years, to pull Democrats out of their decades-long political drought. They must also capture the attention of white voters."
        },
        {
            "type": "text",
            "value": "\"They have to keep an enthusiastic base, while at the same time making more new friends than enemies,\" said Cook, the Democratic consultant from Austin. \"For Democrats in Texas, that's a challenge because we seem to be bleeding Anglo non-college-educated voters.\""
        },
        {
            "type": "text",
            "value": "So who might those new friends be? In Dallas and surrounding counties, neighborhoods with more middle-class households were more likely to vote for Clinton this year than they were to vote for Obama in 2012. While Democrats still aren't necessarily winning those counties, they have made gains, suggesting that a strong middle-class message may continue to pay dividends for the party."
        },
        {
            "type": "text",
            "value": "But outreach requires organization and money -- resources that are in short supply for Texas Democrats. For years, the party has been stuck in a failure spiral: No money leads to a lack of organization, which means lackluster campaigns that generate weak candidates who can't raise money because there's little chance of a win."
        },
        {
            "type": "text",
            "value": "\"It's a vicious circle, but you have to just keep plugging at it and plugging at it and plugging at it,\" Cook said. \"Sooner or later, you sneak up on them.\""
        },
        {
            "type": "text",
            "value": "Breaking that circle will require a confluence of favorable circumstances, including a charismatic statewide candidate who can raise money, organize supporters and motivate voters across demographic groups. It will also require Republicans, both at the national level and in state offices, to alienate voters with either wildly unpopular policies or scandalous corruption, maybe both."
        },
        {
            "type": "text",
            "value": "While waiting for those stars to align, Democrats are working to build a bench of potential statewide office candidates with successes in local races. They've had wins in Dallas and Houston, where elections have ushered in Democrats like Houston Mayor Sylvester Turner, Dallas Mayor Mike Rawlings and Dallas County Judge Clay Jenkins."
        },
        {
            "type": "text",
            "value": "But the going is slow, and there are few signs that a Democratic resurgence is imminent, or even a far-off possibility, in the Lone Star State. Nevertheless, party devotees remain optimistic that another savior will finally put a win in the Democrats' column."
        },
        {
            "type": "text",
            "value": "\"Eventually it will start to coalesce around individuals,\" Aldrete said. \"I think the viability of what's possible in 2020 is going to be a lot higher than what you're seeing today.\""
        },
        {
            "type": "embed",
            "value": {
                "slug": "state-correlation-charts",
                "headline": "How Texans voted",
                "chatter": "While college education was the most significant dividing line between Democrats and Republicans in many swing states this year, demographics played out differently in Texas. Race, not college education, divided red and blue in the state."
            }
        },
        {
            "type": "embed",
            "value": {
                "slug": "correction",
                "text": "A previous version of this story published only in print incorrectly said the 2016 election was the worst election for Texas Democrats since 1992. Democrats fare worse in Texas during nonpresidential cycles, when turnout is significantly lower. The story also said Democrats lost in more counties than at any point in the last decade. They won slightly fewer counties in 2010, 2012 and 2014."
            }
        }
    ]
}